AthenasArch/ESP32S3-CAN-OBD2-Firmware/lib/AthenasArch-ESP32_OBD2/src/athenasObd2.cpp
    for (auto &t : tries)
    {
        if (t.mode == OBD2_ADDR_11BIT)
        {
            if (begin(t.baud))
            {
                _addrMode = OBD2_ADDR_11BIT;
                _baud = t.baud;
                return 1;
            }
        }
        else
        {
            if (startCan29bit(t.baud))
            {
                _addrMode = OBD2_ADDR_29BIT;
                _baud = t.baud;
                return 1;
            }
        }
    }
    return 0; // nenhum protocolo encontrado
}

void OBD2Class::end()
{
    //  CAN0.end();
}

void OBD2Class::closeBus() {
    if (!_connected && _baud == 0) {
        return; // já está fechado, não precisa mexer
    }
    CAN0.disable();
    _connected = false;
    _baud = 0;
}

bool OBD2Class::pidSupported(uint8_t pid)
{
    if (pid == 0)
    {
        return true;
    }

    return (_supportedPids[(pid - 1) / 0x20] & ((1UL << (31 - ((pid - 1) % 32))))) ? true : false;
}

bool OBD2Class::connected() const { return _connected; }
uint32_t OBD2Class::currentBaud() const { return _baud; }
bool OBD2Class::isExtended() const { return (_addrMode == OBD2_ADDR_29BIT); }

bool OBD2Class::pidValueRaw(uint8_t pid)
{
    switch (pid)
    {
    case PIDS_SUPPORT_01_20:                                // raw
    case MONITOR_STATUS_SINCE_DTCS_CLEARED:                 // raw
    case FREEZE_DTC:                                        // raw
    case PIDS_SUPPORT_21_40:                                // raw
    case PIDS_SUPPORT_41_60:                                // raw
    case MONITOR_STATUS_THIS_DRIVE_CYCLE:                   // raw
    case FUEL_SYSTEM_STATUS:                                // raw
    case COMMANDED_SECONDARY_AIR_STATUS:                    // raw
    case OBD_STANDARDS_THIS_VEHICLE_CONFORMS_TO:            // raw
    case OXYGEN_SENSORS_PRESENT_IN_2_BANKS:                 // raw
    case OXYGEN_SENSORS_PRESENT_IN_4_BANKS:                 // raw
    case AUXILIARY_INPUT_STATUS:                            // raw
    case FUEL_TYPE:                                         // raw
    case EMISSION_REQUIREMENT_TO_WHICH_VEHICLE_IS_DESIGNED: // raw
        return true;

    default:
        return (pid > 0x5f);
    }
}

String OBD2Class::pidName(uint8_t pid)
{
    if (pid > 0x5f)
    {
        return "Unknown";
    }
    return PID_NAME_MAPPER[pid];
}

String OBD2Class::pidUnits(uint8_t pid)
{
    if (pid > 0x5f)
    {
        return "";
    }

    return PID_UNIT_MAPPER[pid];
}

bool OBD2Class::readPid(uint8_t pid, float &out) {
    if (_addrMode == OBD2_ADDR_29BIT) {
        // 29-bit manual
        return pidRead29(pid, out);
    } else {
        // 11-bit alto nível
        if (!pidSupported(pid)) return false;
        float v = pidRead(pid); // float
        if (isnan(v)) return false;
        out = v;
        return true;
    }
}

float OBD2Class::pidRead(uint8_t pid)
{
    if (!pidSupported(pid)) {
        return NAN;
    }

    uint8_t value[4];
    if (!pidRead(0x01, pid, &value, sizeof(value))) {
        return NAN;
    }

#define A value[0]
#define B value[1]
#define C value[2]
#define D value[3]

    switch (pid) {
    case PIDS_SUPPORT_01_20:
    case MONITOR_STATUS_SINCE_DTCS_CLEARED:
    case FREEZE_DTC:
    case PIDS_SUPPORT_21_40:
    case PIDS_SUPPORT_41_60:
    case MONITOR_STATUS_THIS_DRIVE_CYCLE:
        return ((uint32_t)A << 24 | (uint32_t)B << 16 | (uint32_t)C << 8 | (uint32_t)D);

    case FUEL_SYSTEM_STATUS:
    case RUN_TIME_SINCE_ENGINE_START:
    case DISTANCE_TRAVELED_WITH_MIL_ON:
    case DISTANCE_TRAVELED_SINCE_CODES_CLEARED:
    case TIME_RUN_WITH_MIL_ON:
    case TIME_SINCE_TROUBLE_CODES_CLEARED:
        return (A * 256.0 + B);

    case CALCULATED_ENGINE_LOAD:
    case THROTTLE_POSITION:
    case COMMANDED_EGR:
    case COMMANDED_EVAPORATIVE_PURGE:
    case FUEL_TANK_LEVEL_INPUT:
    case RELATIVE_THROTTLE_POSITION:
    case ABSOLUTE_THROTTLE_POSITION_B:
    case ABSOLUTE_THROTTLE_POSITION_C:
    case ABSOLUTE_THROTTLE_POSITION_D:
    case ABSOLUTE_THROTTLE_POSITION_E:
    case ABSOLUTE_THROTTLE_POSITION_F:
    case COMMANDED_THROTTLE_ACTUATOR:
    case ETHANOL_FUEL_PERCENTAGE:
    case RELATIVE_ACCELERATOR_PEDAL_POSITTION:
    case HYBRID_BATTERY_PACK_REMAINING_LIFE:
        return (A / 2.55);

    case COMMANDED_SECONDARY_AIR_STATUS:
    case OBD_STANDARDS_THIS_VEHICLE_CONFORMS_TO:
    case OXYGEN_SENSORS_PRESENT_IN_2_BANKS:
    case OXYGEN_SENSORS_PRESENT_IN_4_BANKS:
    case AUXILIARY_INPUT_STATUS:
    case FUEL_TYPE:
    case EMISSION_REQUIREMENT_TO_WHICH_VEHICLE_IS_DESIGNED:
        return (A);

    case OXYGEN_SENSOR_1_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_2_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_3_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_4_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_5_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_6_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_7_SHORT_TERM_FUEL_TRIM:
    case OXYGEN_SENSOR_8_SHORT_TERM_FUEL_TRIM:
        return ((B / 1.28) - 100.0);

    case ENGINE_COOLANT_TEMPERATURE:
    case AIR_INTAKE_TEMPERATURE:
    case AMBIENT_AIR_TEMPERATURE:
    case ENGINE_OIL_TEMPERATURE:
        return (A - 40.0);

    case SHORT_TERM_FUEL_TRIM_BANK_1:
    case LONG_TERM_FUEL_TRIM_BANK_1:
    case SHORT_TERM_FUEL_TRIM_BANK_2:
    case LONG_TERM_FUEL_TRIM_BANK_2:
    case EGR_ERROR:
        return ((A / 1.28) - 100.0);

    case FUEL_PRESSURE:
        return (A * 3.0);

    case INTAKE_MANIFOLD_ABSOLUTE_PRESSURE:
    case VEHICLE_SPEED:
    case WARM_UPS_SINCE_CODES_CLEARED:
    case ABSOLULTE_BAROMETRIC_PRESSURE:
        return (A);

    case ENGINE_RPM:
        return ((A * 256.0 + B) / 4.0);

    case TIMING_ADVANCE:
        return ((A / 2.0) - 64.0);

    case MAF_AIR_FLOW_RATE:
        return ((A * 256.0 + B) / 100.0);

    case FUEL_RAIL_PRESSURE:
        return ((A * 256.0 + B) * 0.079);

    case FUEL_RAIL_GAUGE_PRESSURE:
    case FUEL_RAIL_ABSOLUTE_PRESSURE:
        return ((A * 256.0 + B) * 10.0);

    case OXYGEN_SENSOR_1_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_2_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_3_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_4_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_5_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_6_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_7_FUEL_AIR_EQUIVALENCE_RATIO:
    case OXYGEN_SENSOR_8_FUEL_AIR_EQUIVALENCE_RATIO:
    case 0x34: case 0x35: case 0x36: case 0x37:
    case 0x38: case 0x39: case 0x3a: case 0x3b:
        return (((A * 256.0 + B) * 2.0) / 65536.0);

    case EVAP_SYSTEM_VAPOR_PRESSURE:
        return (((int16_t)(A * 256.0 + B)) / 4.0);

    case CATALYST_TEMPERATURE_BANK_1_SENSOR_1:
    case CATALYST_TEMPERATURE_BANK_2_SENSOR_1:
    case CATALYST_TEMPERATURE_BANK_1_SENSOR_2:
    case CATALYST_TEMPERATURE_BANK_2_SENSOR_2:
        return (((A * 256.0 + B) / 10.0) - 40.0);

    case CONTROL_MODULE_VOLTAGE:
        return ((A * 256.0 + B) / 1000.0);

    case ABSOLUTE_LOAD_VALUE:
        return ((A * 256.0 + B) / 2.55);

    case FUEL_AIR_COMMANDED_EQUIVALENCE_RATE:
        return (2.0 * (A * 256.0 + B) / 65536.0);

    case ABSOLUTE_EVAP_SYSTEM_VAPOR_PRESSURE:
        return ((A * 256.0 + B) / 200.0);

    case 0x54:
        return ((A * 256.0 + B) - 32767.0);

